<?php

use yii\db\Migration;

class m170627_105839_fill_district_table extends Migration
{
     public function up()
    {
        $adistrict = [
            'Житомир місто',
            'Житомирський район',
            'Олевський район',
            'Лугинський район',
            'Овруцький район',
            'Новоград-Волинський місто',
            'Новоград-Волинський район',
            'Народицький район',
            'Ємільчинський район',
            'Володарсько - Волинський район',
            'Коростень місто',
            'Коростенський район',
            'Малин місто',
            'Малинський район',
            'Радомишльський район',
            'Червоноармійський район',
            'Баранівський район',
            'Черняхівський район',
            'Коростишівський район',
            'Брусилівський район',
            'Романівський район',
            'Любарський район',
            'Бердичів місто',
            'Бердичівський район',
            'Чуднівський район',
            'Андрушівський район',
            'Попільнянський район',
            'Ружинський район',
        ];    
        $currt = time();
        foreach ($adistrict as $value) {
            $this->insert('district', [
                'name' => $value,
                'branch_id' =>  1,
                'created_at' => $currt,
                'updated_at' => $currt,
                'created_by' => 1,
                'updated_by' => 1,
                ]);
        }
    }

    /**
     * @inheritdoc
     */
    public function down()
    {
        return false;
    }

}
